"use client";

import { useEffect, useState } from "react";

export function HomePartners() {
  const [mounted, setMounted] = useState(false);
  const [coloredPartners, setColoredPartners] = useState<
    { name: string; color: string }[]
  >([]);

  const partners: string[] = [
    "Чупин Алексей ",
    "Кудермесов Эдуард ",
    "Сарматин Михаил ",
    "Гоголев Дмитрий ",
    "Царев Андрей ",
    "Варламов Евгений ",
    "Атюшов Виталий ",
    "Добрыш Алексей ",
    "Никитенко Андрей ",
    "Шаргородский Олег ",
    "Жиру Раймон ",
    "Морозов Алексей ",
    "Зарипов Данис ",
    "Федоров Евгений ",
    "Валиулин Марат ",
    "Хабибуллин Николай ",
    "Ковальчук Илья ",
    "Сапрыкин Олег ",
    "Кудашов Алексей ",
    "Скопинцев Андрей ",
    "Константинов Евгений ",
    "Зубов Илья ",
    "Федоров Сергей ",
    "Зубов Сергей ",
    "Марков Даниил ",
    "Кольцов Кирилл ",
    "Вишневский Виталий ",
    "Мирнов Игорь ",
    "Кайгородов Алексей ",
    "Епачинцев Вадим ",
    "Волков Алексей ",
    "Зайнуллин Руслан ",
    "Тертышный Алексей ",
    "Бабенко Юрий ",
    "Трофимов Александр ",
    "Завьялов Александр ",
    "Волченков Антон ",
    "Петров Алексей ",
    "Власенков Дмитрий ",
    "Радулов Игорь ",
    "Прошкин Виталий ",
    "Калинин Дима ",
    "Кутейкин Алексей ",
    "Костицын Андрей ",
    "Костицын Сергей ",
    "Жамнов Алексей ",
    "Марков Даниил ",
    "Бойков Саша ",
    "Буцаев Вячеслав ",
    "Чистов Виктор ",
    "Свитов Александр ",
    "Пережогин Александр ",
    "Ячанов Дмитрий ",
    "Великов Максим ",
    "Игнатов Николай ",
    "Первышин Андрей ",
    "Архипов Денис ",
    "Козлов Вячеслав ",
    "Платонов Денис ",
    "Панков Александр ",
    "Калинин Дмитрий ",
    "Арекаев Сергей ",
    "Гонолев Дмитрий ",
    "Карпов Валерий ",
    "Макаров Константин ",
    "Вышедкевич Сергей ",
    "Ореховский Олег ",
    "Бабенко Юрий ",
    "Жердев Николай ",
    "Кваша Олег ",
    "Никулин Александр ",
    "Цыплаков Владимир ",
    "Березин Сергей ",
    "Агаков Павел ",
    "Кондратьев Максим ",
    "Востриков Сергей ",
    "Бирюков Миша ",
    "Дерлюк Роман ",
    "Осипов Саша ",
    "Антоненко Олег ",
    "Волошенко Роман ",
    "Зайнуллин Руслан ",
    "Калачик Виктор ",
    "Столяров Геннадий ",
    "Галимов Станислав ",
    "Алексеев Никита ",
    "Толпеко Денис ",
    "Комаров Никита ",
    "Ежов Илья ",
    "Григорьев Михаил ",
    "Кольцов Николай ",
    "Кольцов Кирилл ",
    "Моня Дмитрий ",
    "Филатов Никита ",
    "Потапов Алексей ",
    "Гончаров Максим ",
    "Яласваара Янне ",
    "Кувалдин Александр ",
    "Шафигулин Григорий ",
    "Давыдов Марат ",
    "Чернов Артем ",
    "Точицкий Никита ",
    "Тернавски Артем ",
    "Мишарин Георгий ",
    "Ерофеев Дмитрий ",
    "Хайдаров Ремир ",
    "Золотов Сергей ",
    "Козлов Вячеслав ",
    "Евстафьев Андрей ",
    "Болтунов Олег ",
    "Трубачев Юрий ",
    "Скороходов Игорь ",
    "Суглобов Александр ",
    "Клементьев Сергей ",
    "Кузнецов Александр ",
    "Калинин Дмитрий ",
  ];

  useEffect(() => {
    setMounted(true);
    if (mounted) {
      const indices = Array.from({ length: partners.length }, (_, i) => i);
      for (let i = indices.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [indices[i], indices[j]] = [indices[j], indices[i]];
      }
      const selectedIndices = indices.slice(0, 6);

      const colors = [
        "text-orange-500",
        "text-orange-500",
        "text-orange-500",
        "text-[#171D3D]",
        "text-[#171D3D]",
        "text-[#171D3D]",
      ].sort(() => Math.random() - 0.5);

      const selectedPartners = selectedIndices.map((index, i) => ({
        name: partners[index],
        color: colors[i],
      }));

      setColoredPartners(selectedPartners);
    }
  }, [mounted]);

  if (!mounted) return null;

  return (
    <div className="justify-center items-center flex flex-col my-12 px-2 lg:px-0 lg:my-16">
      <div className="w-full lg:w-10/12">
        <h2 className="font-bold text-3xl text-[#171D3D] lg:text-4xl w-10/12">
          С НАМИ РАБОТАЛИ ТАКИЕ ИЗВЕСТНЫЕ ИГРОКИ КАК
        </h2>
      </div>
      <p className="font-bold text-[17px] lg:text-[32px] leading-[17px] lg:leading-[32px] text-[#ECECEC] text-justify lg:w-10/12">
        {partners.map((partner, index) => (
          <span
            key={index}
            className={
              coloredPartners.find((p) => p.name === partner)?.color || ""
            }
          >
            {partner}
          </span>
        ))}
      </p>
    </div>
  );
}
